cf_billing/InformationRegisters/бестТарифныеКатегорииНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТарифныеКатегорииНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТарифнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/бестРаботаСПараметрамиРасчетаКонтрагентовСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьГруппуПотребителей(Движения, ДанныеШапки) Экспорт 
 	
	Для Каждого СтрокаВида Из ДанныеШапки.ТарифныеКатегорииУслуги Цикл
		Набор 							= Движения.бестТарифныеКатегорииНП;
		Запись							= Набор.Добавить();
		Запись.Период  					= ДанныеШапки.Дата;
		Запись.Район  					= ДанныеШапки.Район;
		Запись.Организация  			= ДанныеШапки.Организация;
		Запись.Договор 					= ДанныеШапки.Договор;
		Запись.ОбъектРасчета 			= ДанныеШапки.ОбъектРасчета;
		Запись.ТарифнаяКатегория  		= СтрокаВида.ТарифнаяКатегория;
		Запись.Услуга  					= СтрокаВида.Услуга;
		Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьДвижение(ДанныеШапки,ДвиженияНабор)  Экспорт 
	
	Запись = ДвиженияНабор.добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);		
КонецПроцедуры

Процедура ВыполнитьДвижения(ДанныеШапки,ДвиженияНабор,ИмяКоллекции)  Экспорт
	Для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ДанныеШапки.Свойство("Приход") Тогда
			Если ДанныеШапки.Приход Тогда
				Запись = ДвиженияНабор.ДобавитьПриход();
			Иначе
				Запись = ДвиженияНабор.ДобавитьРасход();
			КонецЕсли;
		Иначе
			Запись = ДвиженияНабор.добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, стр);
		ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);		
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса, ДвиженияНабор, СоответствиеКолонок = Неопределено)  Экспорт
	Выборка	= РезультатЗапроса.выбрать();	
	Пока Выборка.Следующий() цикл		
		Запись	= ДвиженияНабор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Если СоответствиеКолонок <> Неопределено Тогда 
			ДЛя Каждого ТекСоответствие Из СоответствиеКолонок Цикл
				Запись[ТекСоответствие.Ключ] = Выборка[ТекСоответствие.Значение];
			КонецЦикла;	
		КонецЕсли;			                                       
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
